window.OLD_DATA=[
  {
    "d": "2026-08-03",
    "t": "in",
    "ds": "ส่งก๋วยเตี๋ยว",
    "a": 540,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-03",
    "t": "in",
    "ds": "ค่ากับข้าว",
    "a": 100,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-03",
    "t": "ex",
    "ds": "ผัก",
    "a": 100,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-03",
    "t": "ex",
    "ds": "เส้นก๋วยเตี๋ยว",
    "a": 70,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-03",
    "t": "ex",
    "ds": "หมู",
    "a": 220,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-03",
    "t": "ex",
    "ds": "ค่ารถ",
    "a": 45,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-03",
    "t": "ex",
    "ds": "หมูยอ",
    "a": 90,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-04",
    "t": "in",
    "ds": "ส่งก๋วยเตี๋ยว",
    "a": 557,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-04",
    "t": "in",
    "ds": "ค่ากับข้าว",
    "a": 100,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-05",
    "t": "ex",
    "ds": "หมู",
    "a": 267,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-05",
    "t": "ex",
    "ds": "ผัก",
    "a": 140,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-05",
    "t": "ex",
    "ds": "ไก่",
    "a": 210,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-05",
    "t": "ex",
    "ds": "เส้นก๋วยเตี๋ยว",
    "a": 65,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-05",
    "t": "ex",
    "ds": "ถุง+กล่อง",
    "a": 220,
    "c": "กล่อง/ถุง"
  },
  {
    "d": "2026-08-05",
    "t": "ex",
    "ds": "ปูอัด",
    "a": 99,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-05",
    "t": "ex",
    "ds": "ค่ารถ",
    "a": 80,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-05",
    "t": "ex",
    "ds": "บุหรี่",
    "a": 144,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-05",
    "t": "ex",
    "ds": "เส้นมาม่า",
    "a": 80,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-05",
    "t": "ex",
    "ds": "เครื่องปรุง",
    "a": 338,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-05",
    "t": "in",
    "ds": "ค่ากับข้าว",
    "a": 100,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-05",
    "t": "in",
    "ds": "ส่งก๋วยเตี๋ยว",
    "a": 599,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-06",
    "t": "ex",
    "ds": "ข้าวคั่ว",
    "a": 10,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-06",
    "t": "ex",
    "ds": "ผักชี",
    "a": 10,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-06",
    "t": "ex",
    "ds": "หอมแดง",
    "a": 60,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-06",
    "t": "ex",
    "ds": "กะเพรา",
    "a": 10,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-06",
    "t": "ex",
    "ds": "กระเทียม",
    "a": 50,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-06",
    "t": "ex",
    "ds": "วุ้นเส้น",
    "a": 75,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-06",
    "t": "ex",
    "ds": "หมูชิ้น",
    "a": 160,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-06",
    "t": "ex",
    "ds": "มะนาว",
    "a": 30,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-06",
    "t": "ex",
    "ds": "ไก่หั่น",
    "a": 41,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-06",
    "t": "ex",
    "ds": "ถั่วลิสงทอด",
    "a": 50,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-06",
    "t": "ex",
    "ds": "น้ำตาลปี๊บ",
    "a": 55,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-06",
    "t": "ex",
    "ds": "เนื้อติดมัน",
    "a": 284,
    "c": "อื่น ๆ"
  },
  {
    "d": "2026-08-06",
    "t": "ex",
    "ds": "ผักสลัด",
    "a": 40,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-06",
    "t": "ex",
    "ds": "ค่ารถ",
    "a": 50,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-06",
    "t": "ex",
    "ds": "ข้าวเหนียว",
    "a": 30,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-06",
    "t": "in",
    "ds": "ค่ากับข้าว",
    "a": 100,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-06",
    "t": "in",
    "ds": "ส่งก๋วยเตี๋ยว",
    "a": 596,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-07",
    "t": "ex",
    "ds": "หมูบด",
    "a": 217,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-07",
    "t": "ex",
    "ds": "ผัก",
    "a": 44,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-07",
    "t": "ex",
    "ds": "กล่อง",
    "a": 75,
    "c": "กล่อง/ถุง"
  },
  {
    "d": "2026-08-07",
    "t": "ex",
    "ds": "เติมwallet",
    "a": 300,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-07",
    "t": "ex",
    "ds": "ค่ารถ",
    "a": 50,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-07",
    "t": "ex",
    "ds": "แตงโม",
    "a": 20,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-07",
    "t": "in",
    "ds": "ค่ากับข้าว",
    "a": 100,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-07",
    "t": "in",
    "ds": "ส่งก๋วยเตี๋ยว",
    "a": 545,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-08",
    "t": "in",
    "ds": "ส่งก๋วยเตี๋ยว",
    "a": 486,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-09",
    "t": "ex",
    "ds": "กล่อง+ถุง",
    "a": 256,
    "c": "กล่อง/ถุง"
  },
  {
    "d": "2026-08-09",
    "t": "ex",
    "ds": "ผัก",
    "a": 60,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-09",
    "t": "ex",
    "ds": "มะนาว",
    "a": 20,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-09",
    "t": "ex",
    "ds": "เส้นผัดไท",
    "a": 50,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-09",
    "t": "ex",
    "ds": "เครื่องผัดไท",
    "a": 110,
    "c": "อื่น ๆ"
  },
  {
    "d": "2026-08-09",
    "t": "ex",
    "ds": "ผัก",
    "a": 68,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-09",
    "t": "ex",
    "ds": "ถั่วงอก+กุ้ยช่าย",
    "a": 33,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-09",
    "t": "ex",
    "ds": "ไข่ไก่",
    "a": 140,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-09",
    "t": "ex",
    "ds": "น้ำ",
    "a": 25,
    "c": "อื่น ๆ"
  },
  {
    "d": "2026-08-09",
    "t": "ex",
    "ds": "ขนม",
    "a": 80,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-09",
    "t": "ex",
    "ds": "ค่ารถ",
    "a": 72,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-09",
    "t": "ex",
    "ds": "เกลือ+ถ่านAAA+น้ำแข็ง",
    "a": 51,
    "c": "อื่น ๆ"
  },
  {
    "d": "2026-08-10",
    "t": "in",
    "ds": "ค่ากับข้าว",
    "a": 100,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-10",
    "t": "in",
    "ds": "ส่งก๋วยเตี๋ยว",
    "a": 541,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-10",
    "t": "ex",
    "ds": "ผัก",
    "a": 160,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-10",
    "t": "ex",
    "ds": "หมูบด",
    "a": 150,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-10",
    "t": "ex",
    "ds": "ไก่หั่น",
    "a": 85,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-10",
    "t": "ex",
    "ds": "ไส้กรอก+เส้นใหญ่+ลูกชิ้น",
    "a": 178,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-10",
    "t": "ex",
    "ds": "มักโรนี+เส้นหมี่+น้ำตาลปี๊บ",
    "a": 95,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-10",
    "t": "ex",
    "ds": "มะนาว+ใบกะเพรา",
    "a": 50,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-10",
    "t": "ex",
    "ds": "ขนม",
    "a": 20,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-10",
    "t": "ex",
    "ds": "บุหรี่",
    "a": 144,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-10",
    "t": "ex",
    "ds": "ยาขยายหลอดลม",
    "a": 290,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-10",
    "t": "ex",
    "ds": "ค่ารถ",
    "a": 55,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-10",
    "t": "ex",
    "ds": "กล่อง 1000 , 750 + ถุงมือ",
    "a": 214,
    "c": "กล่อง/ถุง"
  },
  {
    "d": "2026-08-11",
    "t": "ex",
    "ds": "ตั้งโอ๋+ซอสมะเขือเทศ+น้ำยาปรับผ้านุ่ม",
    "a": 156,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-11",
    "t": "in",
    "ds": "ส่งก๋วยเตี๋ยว",
    "a": 1102,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-11",
    "t": "in",
    "ds": "ค่ากับข้าว",
    "a": 100,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-13",
    "t": "ex",
    "ds": "หมูสามชั้น",
    "a": 115,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-13",
    "t": "ex",
    "ds": "เติมเงินโทรศัพท์",
    "a": 20,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-13",
    "t": "ex",
    "ds": "ผัก",
    "a": 76,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-13",
    "t": "ex",
    "ds": "วุ้นเส้น+ซอสสมะเขือเทศ",
    "a": 128,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-13",
    "t": "ex",
    "ds": "ผักบุ้ง",
    "a": 20,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-13",
    "t": "ex",
    "ds": "เนื้อไก่",
    "a": 80,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-13",
    "t": "ex",
    "ds": "แตงโม",
    "a": 20,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-13",
    "t": "ex",
    "ds": "บุหรี่",
    "a": 72,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-13",
    "t": "ex",
    "ds": "ค่ารถ",
    "a": 50,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-13",
    "t": "ex",
    "ds": "หมูปิ้ง+ขนมทำบุญ",
    "a": 100,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-13",
    "t": "in",
    "ds": "ส่งก๋วยเตี๋ยว",
    "a": 590,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-13",
    "t": "in",
    "ds": "ค่ากับข้าว",
    "a": 200,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-14",
    "t": "in",
    "ds": "ส่งก๋วยเตี๋ยว",
    "a": 465,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-14",
    "t": "ex",
    "ds": "เส้นหมี่+ขนม",
    "a": 71,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-16",
    "t": "ex",
    "ds": "ผัก",
    "a": 262,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-16",
    "t": "ex",
    "ds": "หมูบด+หมูชิ้น",
    "a": 300,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-16",
    "t": "ex",
    "ds": "ไก่หั่น",
    "a": 80,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-16",
    "t": "ex",
    "ds": "มักโรนี+เส้นหมี่+ถั่วป่น",
    "a": 115,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-16",
    "t": "ex",
    "ds": "เส้นใหญ่+บะหมี่+เส้นเล็ก",
    "a": 99,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-16",
    "t": "ex",
    "ds": "ก๋วยเตี๋ยวลุยสวน",
    "a": 50,
    "c": "อื่น ๆ"
  },
  {
    "d": "2026-08-16",
    "t": "ex",
    "ds": "ขนม",
    "a": 40,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-16",
    "t": "ex",
    "ds": "ผักสลัด",
    "a": 67,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-16",
    "t": "ex",
    "ds": "ค่ารถ",
    "a": 49,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-16",
    "t": "ex",
    "ds": "ไส้กรอก+ปูอัด+น้ำมัน+น้ำปลา",
    "a": 470.5,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-16",
    "t": "in",
    "ds": "พี่ฝนให้",
    "a": 100,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-17",
    "t": "in",
    "ds": "ส่งก๋วยเตี๋ยว (ผัดมักโรนี+บะหมี่แห้งคลุก)",
    "a": 590,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-17",
    "t": "ex",
    "ds": "หมูบด",
    "a": 75,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-17",
    "t": "ex",
    "ds": "มะนาว",
    "a": 20,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-17",
    "t": "ex",
    "ds": "พริกจินดาแดง",
    "a": 20,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-17",
    "t": "ex",
    "ds": "แตงโม",
    "a": 20,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-17",
    "t": "ex",
    "ds": "บุหรี่+ครีม",
    "a": 242,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-17",
    "t": "ex",
    "ds": "ค่ารถ",
    "a": 50,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-18",
    "t": "in",
    "ds": "ส่งก๋วยเตี๋ยว (ก๋วยเตี๋ยวคั่วไก่+ยำวุ้นเส้นโบราณ)",
    "a": 607,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-18",
    "t": "in",
    "ds": "ค่ากับข้าว",
    "a": 100,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-18",
    "t": "ex",
    "ds": "หมูบด",
    "a": 129,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-18",
    "t": "ex",
    "ds": "ค่ากับข้าว",
    "a": 142,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-18",
    "t": "ex",
    "ds": "วุ้นเส้น",
    "a": 30,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-18",
    "t": "ex",
    "ds": "อาหารแมว+ไวไว",
    "a": 106,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-18",
    "t": "in",
    "ds": "พี่เคนให้",
    "a": 100,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-19",
    "t": "in",
    "ds": "ส่งก๋วยเตี๋ยว (เส้นหมี่ผัดซีอิ๊ว+ยำมาม่ารวมมิตร",
    "a": 478,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-19",
    "t": "ex",
    "ds": "ค่ารถ",
    "a": 277,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-19",
    "t": "ex",
    "ds": "สุกี้ตี๋น้อย",
    "a": 314,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-19",
    "t": "ex",
    "ds": "46333",
    "a": 100,
    "c": "อื่น ๆ"
  },
  {
    "d": "2026-08-20",
    "t": "in",
    "ds": "ส่งก๋วยเตี๋ยว (เส้นใหญ่ราดหน้า+เส้นเล็กแห้งคลุก)",
    "a": 468,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-20",
    "t": "in",
    "ds": "ค่ากับข้าว",
    "a": 100,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-20",
    "t": "ex",
    "ds": "หมูสามชั้น+หมูชิ้น",
    "a": 214,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-20",
    "t": "ex",
    "ds": "วุ้นเส้น+มะนาว+น้ำมันงา",
    "a": 150,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-20",
    "t": "ex",
    "ds": "ผัก",
    "a": 120,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-20",
    "t": "ex",
    "ds": "เส้นใหญ่+ลูกชิ้น",
    "a": 82,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-20",
    "t": "ex",
    "ds": "แตงโม",
    "a": 20,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-20",
    "t": "ex",
    "ds": "แคปหมู",
    "a": 299,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-20",
    "t": "ex",
    "ds": "ค่ารถ",
    "a": 52,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-21",
    "t": "in",
    "ds": "ส่งก๋วยเตี๋ยว (สามชั้นอบวุ้นเส้น + ยำวุ้นเส้นรวมมิตร)",
    "a": 500,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-21",
    "t": "in",
    "ds": "ค่ากับข้าว",
    "a": 100,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-21",
    "t": "ex",
    "ds": "ค่ากล่อง 750",
    "a": 205,
    "c": "กล่อง/ถุง"
  },
  {
    "d": "2026-08-21",
    "t": "ex",
    "ds": "มะนาว+วุ้นเส้น+เครื่องปรุงซอง+ถั่วป่น",
    "a": 125,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-21",
    "t": "ex",
    "ds": "หมูบด",
    "a": 145,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-21",
    "t": "ex",
    "ds": "ผัก",
    "a": 30,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-21",
    "t": "ex",
    "ds": "ไก่",
    "a": 125,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-21",
    "t": "ex",
    "ds": "แตงโม",
    "a": 20,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-21",
    "t": "ex",
    "ds": "ค่ารถ",
    "a": 25,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-22",
    "t": "in",
    "ds": "ค่าส่งก๋วยเตี๋ยว",
    "a": 200,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-22",
    "t": "ex",
    "ds": "บุหรี่+น้ำยาปรับผ้านุ่ม+น้ำมันหอย",
    "a": 150,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-22",
    "t": "ex",
    "ds": "ค่ารถ",
    "a": 366,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-23",
    "t": "in",
    "ds": "ยืมยาย",
    "a": 500,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-23",
    "t": "in",
    "ds": "พี่เคนให้",
    "a": 200,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-23",
    "t": "ex",
    "ds": "ผัก",
    "a": 157,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-23",
    "t": "ex",
    "ds": "มะนาว+วุ้นเส้น+มาม่า+หอมใหญ่",
    "a": 231,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-23",
    "t": "ex",
    "ds": "เส้นเล็ก+เส้นผัดไท",
    "a": 72,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-23",
    "t": "ex",
    "ds": "บุหรี่",
    "a": 144,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-23",
    "t": "ex",
    "ds": "ค่ารถ",
    "a": 75,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-24",
    "t": "in",
    "ds": "ส่งก๋วยเตี๋ยว (ผัดไท+ยำมาม่ารวมมิตร)",
    "a": 584,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-24",
    "t": "in",
    "ds": "ค่ากับข้าว",
    "a": 100,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-24",
    "t": "ex",
    "ds": "รถกับข้าว",
    "a": 159,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-24",
    "t": "ex",
    "ds": "มะนาว+มะเขือเทศ",
    "a": 50,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-24",
    "t": "ex",
    "ds": "หมูบด",
    "a": 150,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-24",
    "t": "ex",
    "ds": "เครื่องปรุงซอง",
    "a": 50,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-24",
    "t": "ex",
    "ds": "เส้นใหญ่+ลูกชิ้น+เซี่ยงไฮ้+เส้นแก้ว+หมูยอ",
    "a": 218,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-24",
    "t": "ex",
    "ds": "ผักสลัด",
    "a": 30,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-24",
    "t": "ex",
    "ds": "ขนม",
    "a": 50,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-24",
    "t": "ex",
    "ds": "ค่ารถ",
    "a": 45,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-25",
    "t": "in",
    "ds": "ส่งก๋วยเตี๋ยว (หมี่ผัดกระเฉด+ยำเซี่ยงไฮ้)",
    "a": 472,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-25",
    "t": "in",
    "ds": "ค่ากับข้าว",
    "a": 100,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-25",
    "t": "in",
    "ds": "ค่ารีดผ้า",
    "a": 300,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-25",
    "t": "ex",
    "ds": "รถกับข้าว",
    "a": 55,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-26",
    "t": "in",
    "ds": "ส่งก๋วยเตี๋ยว (เส้นเล็กแห้งคลุก+ผัดมักโรนี)",
    "a": 472,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-26",
    "t": "in",
    "ds": "ค่ากับข้าว",
    "a": 100,
    "c": "ขายอาหาร"
  },
  {
    "d": "2026-08-26",
    "t": "ex",
    "ds": "ผัก",
    "a": 210,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-26",
    "t": "ex",
    "ds": "มักโรนี+ซอสมะเขือเทศ+พริกไทย",
    "a": 133,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-26",
    "t": "ex",
    "ds": "เส้นใหญ่+ปลาหลอด",
    "a": 98,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-26",
    "t": "ex",
    "ds": "ผักสลัด",
    "a": 35,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-26",
    "t": "ex",
    "ds": "ไส้กรอก",
    "a": 125,
    "c": "อื่น ๆ"
  },
  {
    "d": "2026-08-26",
    "t": "ex",
    "ds": "ขนม",
    "a": 50,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-26",
    "t": "ex",
    "ds": "ไก่ย่าง",
    "a": 40,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-26",
    "t": "ex",
    "ds": "ข้าวเปล่า",
    "a": 20,
    "c": "วัตถุดิบ"
  },
  {
    "d": "2026-08-26",
    "t": "ex",
    "ds": "บุหรี่",
    "a": 144,
    "c": "ค่าใช้จ่ายส่วนตัว"
  },
  {
    "d": "2026-08-26",
    "t": "ex",
    "ds": "ค่ารถ",
    "a": 46,
    "c": "ค่าส่ง/ค่ารถ"
  },
  {
    "d": "2026-08-26",
    "t": "ex",
    "ds": "ค่าโรงแรม",
    "a": 250,
    "c": "ค่าใช้จ่ายส่วนตัว"
  }
];
